{"legislative_session": "194th", "identifier": "S2669", "title": "Order relative to authorizing the joint committee on Municipalities and Regional Government to make an investigation and study of certain current Senate documents relative to municipalities and regional government matters.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "Senate, October 27, 2025 -- The committee on Municipalities and Regional Government, to whom was referred the petitions (accompanied by bill, Senate, No. 1423) of Michael J. Barrett for legislation to generate revenue to expand transit options; (accompanied by bill, Senate, No. 1437) of Kelly A. Dooner, David F. DeCoste, Colleen M. Garry and Steven S. Howitt for legislation to provide exemptions under the MBTA communities law; (accompanied by bill, Senate, No. 1438) of Kelly A. Dooner and Steven S. Howitt for legislation to grant a compliance extension for certain MBTA adjacent communities; (accompanied by bill, Senate, No. 1439) of Kelly A. Dooner, David F. DeCoste, David F. DeCoste, Colleen M. Garry and others for legislation to exempt certain adjacent communities without direct access to MBTA services from zoning laws; (accompanied by bill, Senate, No. 1440) of Kelly A. Dooner and Steven S. Howitt for legislation ensuring municipalities access to state funding and financial assistance; (accompanied by bill, Senate, No. 1442) of Lydia Edwards for legislation to authorize local control of waste collection hours of operation; (accompanied by bill, Senate, No. 1452) of Edward J. Kennedy, David T. Vieira and Christopher Richard Flanagan for legislation relative to a Municipal Building Assistance Program and Building Authority; (accompanied by bill, Senate, No. 1462) of Patrick M. O'Connor for legislation to improve parking and pedestrian safety by installing parking bollards; (accompanied by bill, Senate, No. 1465) of Patrick M. O'Connor, David F. DeCoste, Colleen M. Garry and Steven S. Howitt for legislation to exempt communities without a rail, subway, or ferry station as an MBTA community designation; (accompanied by bill, Senate, No. 1466) of Patrick M. O'Connor for legislation to restore local zoning control relative to multi-family zoning as-of-right in MBTA communities; (accompanied by bill, Senate, No. 1467) of Patrick M. O'Connor, David F. DeCoste, Colleen M. Garry and Steven S. Howitt for legislation to allow MBTA Communities to seek relief based on certain adverse impacts to the municipality; and (accompanied by bill, Senate, No. 1470) of Pavel M. Payano for legislation relative to the creation of a municipal licensing commission, report the accompanying Order  (Senate, No. 2669)."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Reported from the committee on Municipalities and Regional Government", "date": "2025-10-27", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Accompanied by S1423, S1437, S1438, S1439, S1440, S1442, S1452, S1462, S1465, S1466, S1467 and S1470", "date": "2025-10-27", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Order reported favorably by committee and referred to the committee on Rules of the two branches, acting concurrently", "date": "2025-10-27", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage-favorable", "referral-committee"], "related_entities": [{"name": "committee on Rules of the two branches, acting concurrently", "entity_type": "organization", "organization_id": null}, {"name": "the committee on Rules of the two branches, acting concurrently", "entity_type": "organization", "organization_id": null}]}, {"description": "Discharged to the committee on Senate Rules", "date": "2025-11-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Senate Rules", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Joint Committee on Municipalities and Regional Government", "classification": "primary", "entity_type": "organization", "primary": true, "person_id": null, "organization_id": "~{\"name\": \"Joint Committee on Municipalities and Regional Government\"}"}], "related_bills": [], "versions": [{"note": "Bill Text", "links": [{"url": "https://malegislature.gov/Bills/194/S2669.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://malegislature.gov/Bills/194/S2669", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ma/government", "name": "Massachusetts", "classification": "state", "division_id": "ocd-division/country:us/state:ma"}, "scraped_at": "2026-01-11T10:52:36+00:00", "_id": "a36cca7c-eedb-11f0-b2bd-226c2ff208a8"}